# Angani Sales Data Analysis

# Business Understanding

Description Here

# Business Problem 

Description Here

# Data Understanding 

Description Here

In [6]:
# Necessary Imports
import pandas as pd


# load the excel file
excel_file = pd.ExcelFile('SalesData.xlsx')

# Display the sheet names
print(excel_file.sheet_names)

['Main Data', 'Data Dictionary', 'Product Master']

In [11]:
# Convert the different sheets into dataframes
main_df = excel_file.parse('Main Data')
product_df = excel_file.parse('Product Master')

In [8]:
# main dataframe overview
main_df.head()

,OrderNumber,QuantityOrdered,PriceEach,OrderLineNumber,Sales,Status,QTR_ID,DAY_ID,MONTH_ID,YEAR_ID,...,Phone,AddressLine1,City,PostalCode,Country,Territory,ContactLastName,ContactFirstName,Branch,CostPrice
0,10100,49,34.47,1,1689.03,Shipped,1,6,1,2022,...,6035558647,2304 Long Airport Avenue,Nashua,62005,USA,NaN,Young,Valarie,Skates Road,22.4055
1,10100,50,67.80,2,3390.00,Shipped,1,6,1,2022,...,6035558647,2304 Long Airport Avenue,Nashua,62005,USA,NaN,Young,Valarie,Bergenville,44.0700
2,10100,30,100.00,3,5151.00,Shipped,1,6,1,2022,...,6035558647,2304 Long Airport Avenue,Nashua,62005,USA,NaN,Young,Valarie,Bergenville,65.0000
3,10100,22,86.51,4,1903.22,Shipped,1,6,1,2022,...,6035558647,2304 Long Airport Avenue,Nashua,62005,USA,NaN,Young,Valarie,Skates Road,56.2315
4,10101,26,100.00,1,3773.38,Shipped,1,9,1,2022,...,+49 69 66 90 2555,Lyonerstr. 34,Frankfurt,60528,Germany,EMEA,Keitel,Roland,Bergenville,65.0000

In [10]:
# product dataframe overview
product_df

      ProductLine ProductCode  MSRP
0    Classic Cars    S10_1949   214
1    Classic Cars    S10_4757   136
2    Classic Cars    S10_4962   147
3    Classic Cars    S12_1099   194
4    Classic Cars    S12_1108   207
..            ...         ...   ...
104  Vintage Cars    S24_3816    83
105  Vintage Cars    S24_3969    41
106  Vintage Cars    S24_4258    97
107  Vintage Cars    S32_4289    68
108  Vintage Cars    S50_1341    43

[109 rows x 3 columns]

In [28]:
# Summary of statistics for numeric values. 

print("Main Table")
display(main_df.describe())

print("Product Table")
display(product_df.describe())

Main Table

,OrderNumber,QuantityOrdered,PriceEach,OrderLineNumber,Sales,QTR_ID,DAY_ID,MONTH_ID,YEAR_ID,CostPrice
count,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.00000,2823.000000
mean,10258.725115,35.092809,83.658544,6.466171,3553.889072,2.717676,14.291534,7.092455,2022.81509,54.378054
std,92.085478,9.741443,20.174277,4.225841,1841.865106,1.203878,8.777409,3.656633,0.69967,13.113280
min,10100.000000,6.000000,26.880000,1.000000,482.130000,1.000000,1.000000,1.000000,2022.00000,17.472000
25%,10180.000000,27.000000,68.860000,3.000000,2203.430000,2.000000,6.000000,4.000000,2022.00000,44.759000
50%,10262.000000,35.000000,95.700000,6.000000,3184.800000,3.000000,14.000000,8.000000,2023.00000,62.205000
75%,10333.500000,43.000000,100.000000,9.000000,4508.000000,4.000000,21.000000,11.000000,2023.00000,65.000000
max,10425.000000,97.000000,100.000000,18.000000,14082.800000,4.000000,31.000000,12.000000,2024.00000,65.000000

Product Table

             MSRP
count  109.000000
mean    99.899083
std     39.824603
min     33.000000
25%     68.000000
50%     97.000000
75%    122.000000
max    214.000000

## Data Cleaning

In [23]:
# Check for missing values. 

# Product dataframe
print(product_df.isna().sum())

# Main Dataframe
print(main_df.isnull().sum())

ProductLine    0
ProductCode    0
MSRP           0
dtype: int64
OrderNumber            0
QuantityOrdered        0
PriceEach              0
OrderLineNumber        0
Sales                  0
Status                 0
QTR_ID                 0
DAY_ID                 0
MONTH_ID               0
YEAR_ID                0
ProductCode            0
CustomerName           0
Phone                  0
AddressLine1           0
City                   0
PostalCode            76
Country                0
Territory           1074
ContactLastName        0
ContactFirstName       0
Branch                 0
CostPrice              0
dtype: int64

In [ ]:
# Check the nature of the territory values

In [ ]:
# Check for duplicates

## Exploratory Data Analysis

## 1. Overall Performance

### Sales Over Time(per year)

## Sales per Customer. 

This is a bar graph showing the total sales per customer. 

Draw a table of the territory that each client is located in.

### Sales per Country 

Draw out a list of countries against sales

### Sales per city

Draw out a list of countries against sales

### Sales per product line 

This is to determine the top performing product lines.

### Sales per product category for top performing product lines

### Top performing products for the top product categories.

## 2. Customers

### Bar graph showing top customers

### For top customers : Table of Sales for top product lines.

This will help in customer targeting.

### Top products in customers top product line

## 3. Product diversity

### Top selling products lines for the top countries

### Top selling product lines in top countries

### Top Selling products in top selling product lines for top countries


NB - We could also convert it to top cities.